annoyedmilk/LogicCard/firmware/ch552_serprog/main.c
/********************************** (C) COPYRIGHT *******************************
* File Name          : CDC.C
* Author             : ieiao
* Modified by        : annoyedmilk
* Version            : V1.1
* Date               : 2017/03/01
* Modified Date      : 2025/11/03
* Description        : CH552 serprog implementation for use with flashrom
*                      V1.1: Added FPGA reset/enable control for LogicCard project
*                            - FPGA_RST (Port 1.0) and FPGA_EN (Port 3.3) control
*                            - Automatic FPGA reset before flash operations
*                            - Automatic FPGA enable after flash programming
*                            - LED activity indicator (active low)
*******************************************************************************/
#include <stdint.h>
#include <stdio.h>
#include <string.h>

#include <ch554.h>
#include <ch554_usb.h>
#include <spi.h>
#include <debug.h>
#include "serprog.h"

#define LED_PIN  2
SBIT(LED, 0xb0, LED_PIN);     // Port 3.2 - LED
#define CS_PIN  4
SBIT(CS, 0x90, CS_PIN);       // Port 1.4 - SPI_CS
#define FPGA_RST_PIN  0
SBIT(FPGA_RST, 0x90, FPGA_RST_PIN);  // Port 1.0 - FPGA_RST
#define FPGA_EN_PIN  3
SBIT(FPGA_EN, 0xb0, FPGA_EN_PIN);    // Port 3.3 - FPGA_EN

#define PGMNAME "ch552-serprog"
#define CMD_MAP (\
    (1L << S_CMD_NOP)        | \
    (1L << S_CMD_Q_IFACE)    | \
    (1L << S_CMD_Q_CMDMAP)   | \
    (1L << S_CMD_Q_PGMNAME)  | \
    (1L << S_CMD_Q_SERBUF)   | \
    (1L << S_CMD_Q_BUSTYPE)  | \
    (1L << S_CMD_Q_CHIPSIZE) | \
    (1L << S_CMD_Q_OPBUF)    | \
    (1L << S_CMD_Q_WRNMAXLEN)| \
    (1L << S_CMD_SYNCNOP)    | \
    (1L << S_CMD_Q_RDNMAXLEN)| \
    (1L << S_CMD_S_BUSTYPE)  | \
    (1L << S_CMD_O_SPIOP)    | \
    (1L << S_CMD_S_PIN_STATE)  \
)
#define BUS_SPI (1 << 3)

// Flash chip specifications for W25Q80DVSNIG
// 1 Mbit = 128 KB = 2^17 bytes
#define CHIP_SIZE 17          // log2(128*1024) = 17
#define OPBUF_SIZE 64         // Operation buffer size in bytes
#define MAX_WRITE_N 64        // Maximum write-N length
#define MAX_READ_N 65535      // Maximum read-N length

__xdata __at (0x0000) uint8_t  Ep0Buffer[DEFAULT_ENDP0_SIZE];      // Endpoint 0 OUT & IN buffer, must be an even address
__xdata __at (0x0040) uint8_t  Ep1Buffer[DEFAULT_ENDP1_SIZE];       //Endpoint 1 upload buffer
__xdata __at (0x0080) uint8_t  Ep2Buffer[2*MAX_PACKET_SIZE];        //Endpoint 2 IN & OUT buffer, must be an even address
__xdata __at (0x0100) uint8_t  Ep2Buffer_1[2*MAX_PACKET_SIZE];        //Endpoint 2 IN & OUT buffer, must be an even address

uint16_t SetupLen;
uint8_t   SetupReq, UsbConfig;
const uint8_t * pDescr;                                                       //USB configuration flag
#define UsbSetupBuf     ((PUSB_SETUP_REQ)Ep0Buffer)

#define  SET_LINE_CODING                0X20            // Configures DTE rate, stop-bits, parity, and number-of-character
#define  GET_LINE_CODING                0X21            // This request allows the host to find out the currently configured line coding.
#define  SET_CONTROL_LINE_STATE         0X22            // This request generates RS-232/V.24 style control signals.


/*设备描述符*/
__code uint8_t DevDesc[] = {0x12,0x01,0x10,0x01,0x02,0x00,0x00,DEFAULT_ENDP0_SIZE,
                            0x86,0x1a,0x22,0x57,0x00,0x01,0x01,0x02,
                            0x03,0x01
                           };
__code uint8_t CfgDesc[] ={
    0x09,0x02,0x43,0x00,0x02,0x01,0x00,0xa0,0x32,             //Configuration descriptor (two interfaces)
// The following is the interface 0 (CDC interface) descriptor
    0x09,0x04,0x00,0x00,0x01,0x02,0x02,0x01,0x00, // CDC interface descriptor (one endpoint)
    //The following is the function descriptor
    0x05,0x24,0x00,0x10,0x01,                                 //Function descriptor (header)
    0x05,0x24,0x01,0x00,0x00,                                 //Management descriptor (no data interface) 03 01
    0x04,0x24,0x02,0x02,                                      //stand by,Set_Line_Coding、Set_Control_Line_State、Get_Line_Coding、Serial_State
    0x05,0x24,0x06,0x00,0x01,                                 //CDC interface numbered 0; data interface numbered 1
    0x07,0x05,0x81,0x03,0x08,0x00,0xFF,                       //Interrupt upload endpoint descriptor
    //The following is the interface 1 (data interface) descriptor
    0x09,0x04,0x01,0x00,0x02,0x0a,0x00,0x00,0x00,             //Data interface descriptor
    0x07,0x05,0x02,0x02,0x40,0x00,0x00,                       //Endpoint descriptor
    0x07,0x05,0x82,0x02,0x40,0x00,0x00,                       //Endpoint descriptor
};
/*字符串描述符*/
unsigned char  __code LangDes[]={0x04,0x03,0x09,0x04};           //Language descriptor
unsigned char  __code SerDes[]={                                 //Serial number string descriptor
                                                                 0x0e,0x03,
                                                                 0x32,0x00,0x30,0x00,0x32,0x00,0x32,0x00,0x30,0x00,0x31,0x00,
                               };
unsigned char  __code Prod_Des[]={                                //Product string descriptor
                                                                  0x1C,0x03,
                                                                  0x63,0x00,0x68,0x00,0x35,0x00,0x35,0x00,0x32,0x00,0x2D,0x00,
                                                                  0x73,0x00,0x65,0x00,0x72,0x00,0x70,0x00,0x72,0x00,0x6F,0x00,
                                                                  0x67,0x00,
                                 };
unsigned char  __code Manuf_Des[]={
    0x0c,0x03,
    0x69,0x00,0x65,0x00,0x69,0x00,0x61,0x00,0x6f,0x00,
};

//cdc参数
__xdata uint8_t LineCoding[7]={0x00,0xe1,0x00,0x00,0x00,0x00,0x08};   //The initial baud rate is 57600, 1 stop bit, no parity, 8 data bits.



volatile __idata uint8_t USBByteCount = 0;      //Represents the data received by the USB endpoint
volatile __idata uint8_t UpPoint2_Busy  = 0;   //Whether the upload endpoint is busy

