annoyedmilk/LogicCard/firmware/ch552_serprog/main.c
    }
}

__idata uint32_t slen;
__idata uint32_t rlen;
__idata int8_t usb_send_length = 0;
__idata uint8_t recv_index = 0;

void usb_send(uint8_t length)
{
    UEP2_T_LEN = length; // Pre-use send length must be cleared
    UEP2_CTRL = UEP2_CTRL & ~ MASK_UEP_T_RES | UEP_T_RES_ACK; // Answer ACK
    UpPoint2_Busy = 1;
}

uint8_t recv_buf_getc()
{
    uint8_t tmp;
    while(USBByteCount == 0);
    tmp = Ep2Buffer[recv_index];
    recv_index++;
    if (recv_index == USBByteCount) {
        recv_index = 0;
        USBByteCount = 0;
        UEP2_CTRL = UEP2_CTRL & ~ MASK_UEP_R_RES | UEP_R_RES_ACK;
    }
    return tmp;
}

// FPGA Control Functions
// Based on SLG47910V Table 1. Block Control
// PWR (nRST) EN (nSLEEP) Description
// 0          X           Device Reset/Off State
// 1          0           Lower Power/Retention State
// 1          1           Configuration Mode

void fpga_reset()
{
    // Hold FPGA in reset (PWR=0, EN=X)
    FPGA_RST = 0;  // nRST = 0 (active low)
    FPGA_EN = 0;   // nSLEEP = 0
    mDelaymS(10);  // Hold reset for 10ms
}

void fpga_enable()
{
    // Enable FPGA for configuration (PWR=1, EN=1)
    FPGA_RST = 1;  // nRST = 1 (release reset)
    FPGA_EN = 1;   // nSLEEP = 1 (enable)
    mDelaymS(10);  // Wait for FPGA to start configuration
}

// SPI Bus Control Functions
// Shared SPI bus management between CH552 and FPGA
void spi_bus_take_control()
{
    // Configure SPI pins as outputs (take control of bus)
    // P1.5 = MOSI, P1.6 = MISO, P1.7 = SCK, P1.4 = CS
    P1_MOD_OC = 0x00 | (1 << 6);  // Keep MISO as open-drain, others push-pull
    P1_DIR_PU |= ((1 << CS_PIN) | (1 << 5) | (1 << 6) | (1 << 7));  // Set as outputs
    CS = 1;  // Deselect flash initially
}

void spi_bus_release()
{
    // Release SPI bus - set SPI pins to high-impedance (tri-state)
    // This allows FPGA to control the SPI flash
    CS = 1;  // Deselect flash first
    P1_DIR_PU &= ~((1 << CS_PIN) | (1 << 5) | (1 << 6) | (1 << 7));  // Set as inputs (high-Z)
}

void handle_command()
{
    uint32_t i = 0;
    uint8_t j = 0, k = 0;
    uint8_t c = recv_buf_getc();

    while(UpPoint2_Busy);
    LED = !LED;

    switch(c) {
    case S_CMD_NOP:
        Ep2Buffer[64 + 0] = S_ACK;
        usb_send_length = 1;
        break;

    case S_CMD_Q_IFACE:
        Ep2Buffer[64 + 0] = S_ACK;
        Ep2Buffer[64 + 1] = 0x1;
        Ep2Buffer[64 + 2] = 0x0;
        usb_send_length = 3;
        break;

    case S_CMD_Q_CMDMAP:
        Ep2Buffer[64 + 0] = S_ACK;
        Ep2Buffer[64 + 1] = (CMD_MAP & 0xff);
        Ep2Buffer[64 + 2] = ((CMD_MAP >> 8) & 0xff);
        Ep2Buffer[64 + 3] = ((CMD_MAP >> 16) & 0xff);
        Ep2Buffer[64 + 4] = ((CMD_MAP >> 24) & 0xff);
        for (i = 5; i < 33; i++)
            Ep2Buffer[64 + i] = 0;
        usb_send_length = 33;
        break;

    case S_CMD_Q_PGMNAME:
        Ep2Buffer[64 + 0] = S_ACK;
        while (PGMNAME[i])
        {
            Ep2Buffer[64 + i+1] = PGMNAME[i];
            i++;
        }
        for (; i < 16; i++)
            Ep2Buffer[64 + i+1] = 0;
        usb_send_length = 17;
        break;

    case S_CMD_Q_SERBUF:
        Ep2Buffer[64 + 0] = S_ACK;
        Ep2Buffer[64 + 1] = 0xff;
        Ep2Buffer[64 + 2] = 0xff;
        usb_send_length = 3;
        break;

    case S_CMD_Q_BUSTYPE:
        Ep2Buffer[64 + 0] = S_ACK;
        Ep2Buffer[64 + 1] = BUS_SPI;
        usb_send_length = 2;
        break;

    case S_CMD_Q_CHIPSIZE:
        Ep2Buffer[64 + 0] = S_ACK;
        Ep2Buffer[64 + 1] = (CHIP_SIZE >> 24) & 0xff;
        Ep2Buffer[64 + 2] = (CHIP_SIZE >> 16) & 0xff;
        Ep2Buffer[64 + 3] = (CHIP_SIZE >> 8) & 0xff;
        Ep2Buffer[64 + 4] = CHIP_SIZE & 0xff;
        usb_send_length = 5;
        break;

    case S_CMD_Q_OPBUF:
        Ep2Buffer[64 + 0] = S_ACK;
        Ep2Buffer[64 + 1] = (OPBUF_SIZE >> 8) & 0xff;
        Ep2Buffer[64 + 2] = OPBUF_SIZE & 0xff;
        usb_send_length = 3;
        break;

    case S_CMD_Q_WRNMAXLEN:
        Ep2Buffer[64 + 0] = S_ACK;
        Ep2Buffer[64 + 1] = (MAX_WRITE_N >> 16) & 0xff;
        Ep2Buffer[64 + 2] = (MAX_WRITE_N >> 8) & 0xff;
        Ep2Buffer[64 + 3] = MAX_WRITE_N & 0xff;
        usb_send_length = 4;
        break;

    case S_CMD_Q_RDNMAXLEN:
        Ep2Buffer[64 + 0] = S_ACK;
        Ep2Buffer[64 + 1] = (MAX_READ_N >> 16) & 0xff;
        Ep2Buffer[64 + 2] = (MAX_READ_N >> 8) & 0xff;
        Ep2Buffer[64 + 3] = MAX_READ_N & 0xff;
        usb_send_length = 4;
        break;

    case S_CMD_SYNCNOP:
        Ep2Buffer[64 + 0] = S_NAK;
        Ep2Buffer[64 + 1] = S_ACK;
        usb_send_length = 2;
        break;

    case S_CMD_S_BUSTYPE:
        if ( (recv_buf_getc()|BUS_SPI) == BUS_SPI)
            Ep2Buffer[64 + 0] = S_ACK;
        else
            Ep2Buffer[64 + 0] = S_NAK;
        usb_send_length = 1;
        break;

    case S_CMD_S_PIN_STATE:
        // Pin state: 0 = Hi-Z (FPGA controls SPI), 1 = Driven (CH552 controls SPI)
        i = recv_buf_getc();
        if (i == 0) {
            // Release SPI bus and enable FPGA
            spi_bus_release();
            mDelaymS(1);
            fpga_enable();
            LED = 1;  // Turn off LED
        } else {
            // Take control of SPI bus and hold FPGA in reset
            fpga_reset();
            mDelaymS(1);
            spi_bus_take_control();
            LED = 0;  // Turn on LED
        }
        Ep2Buffer[64 + 0] = S_ACK;
        usb_send_length = 1;
        break;

    case S_CMD_O_SPIOP:
        Ep2Buffer[64 + 0] = S_ACK;
        usb_send_length = 1;
        usb_send(usb_send_length);
        usb_send_length = 0;
        while(UpPoint2_Busy);

        slen = recv_buf_getc() | ((uint32_t)recv_buf_getc() << 8) | (((uint32_t)recv_buf_getc()) << 16);
        rlen = recv_buf_getc() | ((uint32_t)recv_buf_getc() << 8) | (((uint32_t)recv_buf_getc()) << 16);

        CS = 0;
        if (slen > 0) {
            for (i = 0; i < slen; i++)
                CH554SPIMasterWrite(recv_buf_getc());
        }
        k = 0;
        if (rlen > 0) {
            UEP2_CTRL = UEP2_CTRL & ~ MASK_UEP_R_RES | UEP_R_RES_NAK;       //NAK
            for (i = 0; i < (rlen/64); i++) {
                if ( k == 0 ) {
                    for (j = 64; j < 128; j++) {
                        SPI0_DATA = 0xff;
                        while(S0_FREE == 0);
                        Ep2Buffer[j] = SPI0_DATA;
                    }
                } else {
                    for (j = 64; j < 128; j++) {
                        SPI0_DATA = 0xff;
                        while(S0_FREE == 0);
                        Ep2Buffer_1[j] = SPI0_DATA;
                    }
                }
                while(UpPoint2_Busy);
                if ( k == 0 )
                    UEP2_DMA = (uint16_t) Ep2Buffer;                                                      //Endpoint 2 IN data transfer address
                else
                    UEP2_DMA = (uint16_t) Ep2Buffer_1;                                                      //Endpoint 2 IN data transfer address
                k ^= 0x01;
                usb_send(64);
            }

            k = rlen%64;
            while(UpPoint2_Busy);
            UEP2_DMA = (uint16_t) Ep2Buffer;                                                      //Endpoint 2 IN data transfer address
            for (j = 64; j < k + 64; j++) {
                SPI0_DATA = 0xff;
                while(S0_FREE == 0);
                Ep2Buffer[j] = SPI0_DATA;
            }
            usb_send(k);
            UEP2_CTRL = UEP2_CTRL & ~ MASK_UEP_R_RES | UEP_R_RES_ACK;
            while(UpPoint2_Busy);
        }
        CS = 1;
        break;

    default:
        Ep2Buffer[64 + 0] = S_NAK;
        usb_send_length = 1;
        break;
    }

